## Introduction

In this project, we'll work with data from the [CIA World Factbook](https://www.cia.gov/the-world-factbook/), a compendium of statistics about all of the countries on Earth. The Factbook contains demographic information like the following:

* population — the global population.
* population_growth — the annual population growth rate, as a percentage.
* area — the total land and water area.

In this project, we'll use SQL in Jupyter Notebook to analyze data from this database.

We'll use the following code to connect our Jupyter Notebook to our database file:

In [2]:
!conda install -yc conda-forge ipython-sql

Collecting package metadata (current_repodata.json): failed

# >>>>>>>>>>>>>>>>>>>>>> ERROR REPORT <<<<<<<<<<<<<<<<<<<<<<

    Traceback (most recent call last):
      File "/Users/ivandominguez/opt/anaconda3/lib/python3.9/site-packages/urllib3/response.py", line 700, in _update_chunk_length
        self.chunk_left = int(line, 16)
    ValueError: invalid literal for int() with base 16: b''

    During handling of the above exception, another exception occurred:

    Traceback (most recent call last):
      File "/Users/ivandominguez/opt/anaconda3/lib/python3.9/site-packages/urllib3/response.py", line 441, in _error_catcher
        yield
      File "/Users/ivandominguez/opt/anaconda3/lib/python3.9/site-packages/urllib3/response.py", line 767, in read_chunked
        self._update_chunk_length()
      File "/Users/ivandominguez/opt/anaconda3/lib/python3.9/site-packages/urllib3/response.py", line 704, in _update_chunk_length
        raise InvalidChunkLength(self, line)
    urllib3.exceptions.InvalidChunkLength: InvalidChunkLength(got length b'', 0 bytes read)

    During handling of the above exception, another exception occurred:

    Traceback (most recent call last):
      File "/Users/ivandominguez/opt/anaconda3/lib/python3.9/site-packages/requests/models.py", line 760, in generate
        for chunk in self.raw.stream(chunk_size, decode_content=True):
      File "/Users/ivandominguez/opt/anaconda3/lib/python3.9/site-packages/urllib3/response.py", line 575, in stream
        for line in self.read_chunked(amt, decode_content=decode_content):
      File "/Users/ivandominguez/opt/anaconda3/lib/python3.9/site-packages/urllib3/response.py", line 796, in read_chunked
        self._original_response.close()
      File "/Users/ivandominguez/opt/anaconda3/lib/python3.9/contextlib.py", line 137, in __exit__
        self.gen.throw(typ, value, traceback)
      File "/Users/ivandominguez/opt/anaconda3/lib/python3.9/site-packages/urllib3/response.py", line 458, in _error_catcher
        raise ProtocolError("Connection broken: %r" % e, e)
    urllib3.exceptions.ProtocolError: ("Connection broken: InvalidChunkLength(got length b'', 0 bytes read)", InvalidChunkLength(got length b'', 0 bytes read))

    During handling of the above exception, another exception occurred:

    Traceback (most recent call last):
      File "/Users/ivandominguez/opt/anaconda3/lib/python3.9/site-packages/conda/exceptions.py", line 1129, in __call__
        return func(*args, **kwargs)
      File "/Users/ivandominguez/opt/anaconda3/lib/python3.9/site-packages/conda/cli/main.py", line 86, in main_subshell
        exit_code = do_call(args, p)
      File "/Users/ivandominguez/opt/anaconda3/lib/python3.9/site-packages/conda/cli/conda_argparse.py", line 93, in do_call
        return getattr(module, func_name)(args, parser)
      File "/Users/ivandominguez/opt/anaconda3/lib/python3.9/site-packages/conda/notices/core.py", line 72, in wrapper
        return_value = func(*args, **kwargs)
      File "/Users/ivandominguez/opt/anaconda3/lib/python3.9/site-packages/conda/cli/main_install.py", line 22, in execute
        install(args, parser, 'install')
      File "/Users/ivandominguez/opt/anaconda3/lib/python3.9/site-packages/conda/cli/install.py", line 261, in install
        unlink_link_transaction = solver.solve_for_transaction(
      File "/Users/ivandominguez/opt/anaconda3/lib/python3.9/site-packages/conda/core/solve.py", line 156, in solve_for_transaction
        unlink_precs, link_precs = self.solve_for_diff(update_modifier, deps_modifier,
      File "/Users/ivandominguez/opt/anaconda3/lib/python3.9/site-packages/conda/core/solve.py", line 199, in solve_for_diff
        final_precs = self.solve_final_state(update_modifier, deps_modifier, prune, ignore_pinned,
      File "/Users/ivandominguez/opt/anaconda3/lib/python3.9/site-packages/conda/core/solve.py", line 304, in solve_final_state
        ssc = self._collect_all_metadata(ssc)
      File "/Users/ivandominguez/opt/anaconda3/lib/python3.9/site-packages/conda/common/io.py", line 86, in decorated
        return f(*args, **kwds)
      File "/Users/ivandominguez/opt/anaconda3/lib/python3.9/site-packages/conda/core/solve.py", line 467, in _collect_all_metadata
        index, r = self._prepare(prepared_specs)
      File "/Users/ivandominguez/opt/anaconda3/lib/python3.9/site-packages/conda/core/solve.py", line 1061, in _prepare
        reduced_index = get_reduced_index(self.prefix, self.channels,
      File "/Users/ivandominguez/opt/anaconda3/lib/python3.9/site-packages/conda/core/index.py", line 301, in get_reduced_index
        new_records = SubdirData.query_all(spec, channels=channels, subdirs=subdirs,
      File "/Users/ivandominguez/opt/anaconda3/lib/python3.9/site-packages/conda/core/subdir_data.py", line 137, in query_all
        result = tuple(concat(executor.map(subdir_query, channel_urls)))
      File "/Users/ivandominguez/opt/anaconda3/lib/python3.9/concurrent/futures/_base.py", line 609, in result_iterator
        yield fs.pop().result()
      File "/Users/ivandominguez/opt/anaconda3/lib/python3.9/concurrent/futures/_base.py", line 439, in result
        return self.__get_result()
      File "/Users/ivandominguez/opt/anaconda3/lib/python3.9/concurrent/futures/_base.py", line 391, in __get_result
        raise self._exception
      File "/Users/ivandominguez/opt/anaconda3/lib/python3.9/concurrent/futures/thread.py", line 58, in run
        result = self.fn(*self.args, **self.kwargs)
      File "/Users/ivandominguez/opt/anaconda3/lib/python3.9/site-packages/conda/core/subdir_data.py", line 129, in <lambda>
        subdir_query = lambda url: tuple(SubdirData(Channel(url), repodata_fn=repodata_fn).query(
      File "/Users/ivandominguez/opt/anaconda3/lib/python3.9/site-packages/conda/core/subdir_data.py", line 142, in query
        self.load()
      File "/Users/ivandominguez/opt/anaconda3/lib/python3.9/site-packages/conda/core/subdir_data.py", line 207, in load
        _internal_state = self._load()
      File "/Users/ivandominguez/opt/anaconda3/lib/python3.9/site-packages/conda/core/subdir_data.py", line 277, in _load
        raw_repodata_str = fetch_repodata_remote_request(
      File "/Users/ivandominguez/opt/anaconda3/lib/python3.9/site-packages/conda/core/subdir_data.py", line 527, in fetch_repodata_remote_request
        resp = session.get(join_url(url, filename), headers=headers, proxies=session.proxies,
      File "/Users/ivandominguez/opt/anaconda3/lib/python3.9/site-packages/requests/sessions.py", line 542, in get
        return self.request('GET', url, **kwargs)
      File "/Users/ivandominguez/opt/anaconda3/lib/python3.9/site-packages/requests/sessions.py", line 529, in request
        resp = self.send(prep, **send_kwargs)
      File "/Users/ivandominguez/opt/anaconda3/lib/python3.9/site-packages/requests/sessions.py", line 687, in send
        r.content
      File "/Users/ivandominguez/opt/anaconda3/lib/python3.9/site-packages/requests/models.py", line 838, in content
        self._content = b''.join(self.iter_content(CONTENT_CHUNK_SIZE)) or b''
      File "/Users/ivandominguez/opt/anaconda3/lib/python3.9/site-packages/requests/models.py", line 763, in generate
        raise ChunkedEncodingError(e)
    requests.exceptions.ChunkedEncodingError: ("Connection broken: InvalidChunkLength(got length b'', 0 bytes read)", InvalidChunkLength(got length b'', 0 bytes read))

`$ /Users/ivandominguez/opt/anaconda3/bin/conda install -yc conda-forge ipython-sql`

  environment variables:
                 CIO_TEST=<not set>
        CONDA_DEFAULT_ENV=base
                CONDA_EXE=/Users/ivandominguez/opt/anaconda3/bin/conda
             CONDA_PREFIX=/Users/ivandominguez/opt/anaconda3
           CONDA_PREFIX_1=/Users/ivandominguez/miniforge3
    CONDA_PROMPT_MODIFIER=(base)
         CONDA_PYTHON_EXE=/Users/ivandominguez/opt/anaconda3/bin/python
               CONDA_ROOT=/Users/ivandominguez/opt/anaconda3
              CONDA_SHLVL=1
                    CPATH=/usr/local/include
           CURL_CA_BUNDLE=<not set>
                 INFOPATH=/opt/homebrew/share/info:/opt/homebrew/share/info:
             JUPYTER_PATH=/Users/ivandominguez/.vscode/extensions/ms-
                          toolsai.jupyter-2022.4.1021342353/temp/jupyter
             LIBRARY_PATH=/usr/local/lib
                  MANPATH=/opt/homebrew/share/man:/usr/share/man:/usr/local/share/man:/opt/homeb
                          rew/share/man:
                     PATH=/Users/ivandominguez/opt/anaconda3/bin:/Users/ivandominguez/opt/anacon
                          da3/bin:/Users/ivandominguez/opt/anaconda3/bin:/Users/ivandominguez/op
                          t/anaconda3/bin:/Users/ivandominguez/opt/anaconda3/bin:/Users/ivandomi
                          nguez/opt/anaconda3/bin:/Users/ivandominguez/opt/anaconda3/bin:/Users/
                          ivandominguez/opt/anaconda3/bin:/Users/ivandominguez/opt/anaconda3/bin
                          :/Users/ivandominguez/opt/anaconda3/bin:/Users/ivandominguez/opt/anaco
                          nda3/bin:/Users/ivandominguez/opt/anaconda3/bin:/Users/ivandominguez/o
                          pt/anaconda3/bin:/Users/ivandominguez/opt/anaconda3/bin:/Users/ivandom
                          inguez/opt/anaconda3/bin:/Users/ivandominguez/opt/anaconda3/bin:/Users
                          /ivandominguez/opt/anaconda3/bin:/Users/ivandominguez/opt/anaconda3/bi
                          n:/Users/ivandominguez/opt/anaconda3/bin:/Users/ivandominguez/opt/anac
                          onda3/bin:/Users/ivandominguez/opt/anaconda3/bin:/Users/ivandominguez/
                          opt/anaconda3/bin:/Users/ivandominguez/opt/anaconda3/bin:/Users/ivando
                          minguez/opt/anaconda3/bin:/Users/ivandominguez/opt/anaconda3/bin:/User
                          s/ivandominguez/opt/anaconda3/bin:/Users/ivandominguez/opt/anaconda3/b
                          in:/Users/ivandominguez/opt/anaconda3/bin:/Users/ivandominguez/opt/ana
                          conda3/bin:/Users/ivandominguez/opt/anaconda3/bin:/Users/ivandominguez
                          /opt/anaconda3/bin:/Users/ivandominguez/opt/anaconda3/bin:/Users/ivand
                          ominguez/opt/anaconda3/bin:/Users/ivandominguez/opt/anaconda3/bin:/Use
                          rs/ivandominguez/opt/anaconda3/bin:/Users/ivandominguez/opt/anaconda3/
                          bin:/Users/ivandominguez/opt/anaconda3/bin:/Users/ivandominguez/opt/an
                          aconda3/bin:/Users/ivandominguez/opt/anaconda3/bin:/Users/ivandomingue
                          z/opt/anaconda3/bin:/Users/ivandominguez/opt/anaconda3/bin:/Users/ivan
                          dominguez/opt/anaconda3/bin:/Users/ivandominguez/opt/anaconda3/bin:/Us
                          ers/ivandominguez/opt/anaconda3/bin:/Users/ivandominguez/opt/anaconda3
                          /bin:/Users/ivandominguez/opt/anaconda3/bin:/Users/ivandominguez/opt/a
                          naconda3/bin:/Users/ivandominguez/opt/anaconda3/bin:/Users/ivandomingu
                          ez/opt/anaconda3/bin:/Users/ivandominguez/opt/anaconda3/bin:/Users/iva
                          ndominguez/opt/anaconda3/bin:/Users/ivandominguez/opt/anaconda3/bin:/U
                          sers/ivandominguez/opt/anaconda3/bin:/Users/ivandominguez/opt/anaconda
                          3/bin:/Users/ivandominguez/opt/anaconda3/bin:/Users/ivandominguez/opt/
                          anaconda3/bin:/Users/ivandominguez/opt/anaconda3/bin:/Users/ivandoming
                          uez/opt/anaconda3/bin:/Users/ivandominguez/opt/anaconda3/bin:/Users/iv
                          andominguez/opt/anaconda3/bin:/Users/ivandominguez/opt/anaconda3/bin:/
                          Users/ivandominguez/opt/anaconda3/bin:/Users/ivandominguez/opt/anacond
                          a3/bin:/Users/ivandominguez/opt/anaconda3/bin:/opt/homebrew/bin:/opt/h
                          omebrew/sbin:/usr/local/bin:/usr/bin:/bin:/usr/sbin:/sbin:/Library/App
                          le/usr/bin:/Users/ivandominguez/opt/anaconda3/bin:/Users/ivandominguez
                          /opt/anaconda3/condabin:/opt/homebrew/bin:/opt/homebrew/sbin
         PYTHONIOENCODING=utf-8
         PYTHONNOUSERSITE=True
               PYTHONPATH=/Users/ivandominguez/.vscode/extensions/ms-toolsai.jupyter-2022.4.1021
                          342353/pythonFiles:/Users/ivandominguez/.vscode/extensions/ms-
                          toolsai.jupyter-2022.4.1021342353/pythonFiles/lib/python
         PYTHONUNBUFFERED=1
       REQUESTS_CA_BUNDLE=<not set>
            SSL_CERT_FILE=<not set>
   VSCODE_CODE_CACHE_PATH=/Users/ivandominguez/Library/Application
                          Support/Code/CachedData/c3511e6c69bb39013c4a4b7b9566ec1ca73fc4d5

     active environment : base
    active env location : /Users/ivandominguez/opt/anaconda3
            shell level : 1
       user config file : /Users/ivandominguez/.condarc
 populated config files : /Users/ivandominguez/.condarc
          conda version : 22.9.0
    conda-build version : 3.21.8
         python version : 3.9.12.final.0
       virtual packages : __osx=10.16=0
                          __unix=0=0
                          __archspec=1=x86_64
       base environment : /Users/ivandominguez/opt/anaconda3  (writable)
      conda av data dir : /Users/ivandominguez/opt/anaconda3/etc/conda
  conda av metadata url : None
           channel URLs : https://conda.anaconda.org/conda-forge/osx-64
                          https://conda.anaconda.org/conda-forge/noarch
                          https://repo.anaconda.com/pkgs/main/osx-64
                          https://repo.anaconda.com/pkgs/main/noarch
                          https://repo.anaconda.com/pkgs/r/osx-64
                          https://repo.anaconda.com/pkgs/r/noarch
          package cache : /Users/ivandominguez/opt/anaconda3/pkgs
                          /Users/ivandominguez/.conda/pkgs
       envs directories : /Users/ivandominguez/opt/anaconda3/envs
                          /Users/ivandominguez/.conda/envs
               platform : osx-64
             user-agent : conda/22.9.0 requests/2.27.1 CPython/3.9.12 Darwin/21.6.0 OSX/10.16
                UID:GID : 501:20
             netrc file : /Users/ivandominguez/.netrc
           offline mode : False


An unexpected error has occurred. Conda has prepared the above report.

Upload successful.

In [3]:
import sqlite3 as sql

In [4]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

As a next step, we'll query the database to return information on the tables it contains.

In [5]:
%%sql
SELECT *
  FROM sqlite_master
 WHERE type='table';

 * sqlite:///factbook.db
Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

## Overview of the data

Now that we know in which table we'll find the data that interests us, we can start by a query that will give us a sense of what the data looks like.

In [6]:
%%sql
SELECT *
  FROM facts
LIMIT 5;

 * sqlite:///factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

Here are the descriptions for some of the columns:

* name - The name of the country.
* area - The total land and sea area of the country.
* population - The country's population.
* population_growth- The country's population growth as a percentage.
* birth_rate - The country's birth rate, or the number of births a year per 1,000 people.
* death_rate - The country's death rate, or the number of death a year per 1,000 people.
* area- The country's total area (both land and water).
* area_land - The country's land area in square kilometers.
* area_water - The country's waterarea in square kilometers.

Let's start by calculating some summary statistics and see what they tell us.

## Summary statistics

In [7]:
%%sql
SELECT MIN(population) AS min_pop,
       MAX(population) AS max_pop,
       MIN(population_growth) AS min_pop_growth,
       MAX(population_growth) max_pop_growth 
  FROM facts;

 * sqlite:///factbook.db
Done.

[(0, 7256490011, 0.0, 4.02)]

A few things stick out from the summary statistics in the last screen:

* There's a country with a population of 0
* There's a country with a population of 7256490011 (or more than 7.2 billion people)

Let's use subqueries to zoom in on just these countries *without* using the specific values.

## Exploring Outliers

In [8]:
%%sql
SELECT *
  FROM facts
 WHERE population == (SELECT MIN(population)
                        FROM facts
                     );

 * sqlite:///factbook.db
Done.

[(250, 'ay', 'Antarctica', None, 280000, None, 0, None, None, None, None)]

It seems like the table contains a row for Antarctica, which explains the population of 0. This seems to match the CIA Factbook [page for Antarctica](https://www.cia.gov/the-world-factbook/countries/antarctica).

In [9]:
%%sql
SELECT *
  FROM facts
 WHERE population == (SELECT MAX(population)
                        FROM facts
                     );

 * sqlite:///factbook.db
Done.

[(261, 'xx', 'World', None, None, None, 7256490011, 1.08, 18.6, 7.8, None)]

We also see that the table contains a row for the whole world, which explains the maximum population of over 7.2 billion we found earlier.

Now that we know this, we should recalculate the summary statistics we calculated earlier, while excluding the row for the whole world.

## Summary statistics revisited

In [10]:
%%sql
SELECT MIN(population) AS min_pop,
       MAX(population) AS max_pop,
       MIN(population_growth) AS min_pop_growth,
       MAX(population_growth) max_pop_growth 
  FROM facts
WHERE name <> 'World';

 * sqlite:///factbook.db
Done.

[(0, 1367485388, 0.0, 4.02)]

There's a country whose population closes in on 1.4 billion!

## Exploring Average Population and Area

Let's explore density. Density depends on the population and the country's area. Let's look at the average values for these two columns.

We should take care of discarding the row for the whole planet.

In [11]:
%%sql
SELECT AVG(population) AS avg_population, AVG(area) AS avg_area
  FROM facts
 WHERE name <> 'World';

 * sqlite:///factbook.db
Done.

[(32242666.56846473, 555093.546184739)]

We see that the average population is around 32 million and the average area is 555 thousand square kilometers.

## Finding Densely Populated Countries

To finish, we'll build on the query above to find countries that are densely populated. We'll identify countries that have:

* Above average values for population.
* Below average values for area.

In [12]:
%%sql
SELECT *
  FROM facts
 WHERE population > (SELECT AVG(population)
                       FROM facts
                      WHERE name <> 'World'
                    )
   AND area < (SELECT AVG(area)
                 FROM facts
                WHERE name <> 'World'
);

 * sqlite:///factbook.db
Done.

[(14, 'bg', 'Bangladesh', 148460, 130170, 18290, 168957745, 1.6, 21.14, 5.61, 0.46),
 (65, 'gm', 'Germany', 357022, 348672, 8350, 80854408, 0.17, 8.47, 11.42, 1.24),
 (80, 'iz', 'Iraq', 438317, 437367, 950, 37056169, 2.93, 31.45, 3.77, 1.62),
 (83, 'it', 'Italy', 301340, 294140, 7200, 61855120, 0.27, 8.74, 10.19, 4.1),
 (85, 'ja', 'Japan', 377915, 364485, 13430, 126919659, 0.16, 7.93, 9.51, 0.0),
 (91, 'ks', 'Korea, South', 99720, 96920, 2800, 49115196, 0.14, 8.19, 6.75, 0.0),
 (120, 'mo', 'Morocco', 446550, 446300, 250, 33322699, 1.0, 18.2, 4.81, 3.36),
 (138, 'rp', 'Philippines', 300000, 298170, 1830, 100998376, 1.61, 24.27, 6.11, 2.09),
 (139, 'pl', 'Poland', 312685, 304255, 8430, 38562189, 0.09, 9.74, 10.19, 0.46),
 (163, 'sp', 'Spain', 505370, 498980, 6390, 48146134, 0.89, 9.64, 9.04, 8.31),
 (173, 'th', 'Thailand', 513120, 510890, 2230, 67976405, 0.34, 11.19, 7.8, 0.0),
 (182, 'ug', 'Uganda', 241038, 197100, 43938, 37101745, 3.24, 43.79, 10.69, 0.74),
 (185, 'uk', 'United Kingdom', 243610, 241930, 1680, 64088222, 0.54, 12.17, 9.35, 2.54),
 (192, 'vm', 'Vietnam', 331210, 310070, 21140, 94348835, 0.97, 15.96, 5.93, 0.3)]

Some of these countries are generally known to be densely populated, so we have confidence in our results!

## Most populated country and highest growth rate

Now, let's find out which country is the most populated and which country has the highest growth rate.

In [13]:
%%sql
SELECT name, population
FROM facts
WHERE population = (SELECT MAX(population) FROM facts WHERE name <> 'World')

 * sqlite:///factbook.db
Done.

[('China', 1367485388)]

The most populated country is China, with a population of approx. 1.37 billion.

In [14]:
%%sql
SELECT name, population_growth
FROM facts
WHERE population_growth = (SELECT MAX(population_growth) FROM facts WHERE name <> 'World')

 * sqlite:///factbook.db
Done.

[('South Sudan', 4.02)]

The country with the highest growth rate is South Sudan, with 4.02%

## Top 10 and bottom 10 populated countries

Now, let's have a closer look at the countries with the highest population.

In [21]:
%%sql
SELECT name, population as top5_population
FROM facts
WHERE name <> 'World'
ORDER BY population DESC
LIMIT 10;

 * sqlite:///factbook.db
Done.

[('China', 1367485388),
 ('India', 1251695584),
 ('European Union', 513949445),
 ('United States', 321368864),
 ('Indonesia', 255993674),
 ('Brazil', 204259812),
 ('Pakistan', 199085847),
 ('Nigeria', 181562056),
 ('Bangladesh', 168957745),
 ('Russia', 142423773)]

We notice that the European Union is listed as a country, which doesn't make sense. It would be better to exlude it. Let's do that.

In [25]:
%%sql
SELECT name, population AS top5_population
  FROM facts
WHERE name != 'World' 
  AND name != 'European Union'
ORDER BY population DESC
LIMIT 10;

 * sqlite:///factbook.db
Done.

[('China', 1367485388),
 ('India', 1251695584),
 ('United States', 321368864),
 ('Indonesia', 255993674),
 ('Brazil', 204259812),
 ('Pakistan', 199085847),
 ('Nigeria', 181562056),
 ('Bangladesh', 168957745),
 ('Russia', 142423773),
 ('Japan', 126919659)]

We see that the most populated country is **China** (which we saw earlier), followed by **India**, then with a big gap by the **United States**, **Indonesia**, and **Brazil**.

In [26]:
%%sql
SELECT name, population as bottom5_population
FROM facts
WHERE name != 'Antarctica'
  AND population NOT NULL
ORDER BY population
LIMIT 10;

 * sqlite:///factbook.db
Done.

[('Pitcairn Islands', 48),
 ('Cocos (Keeling) Islands', 596),
 ('Holy See (Vatican City)', 842),
 ('Niue', 1190),
 ('Tokelau', 1337),
 ('Christmas Island', 1530),
 ('Svalbard', 1872),
 ('Norfolk Island', 2210),
 ('Falkland Islands (Islas Malvinas)', 3361),
 ('Montserrat', 5241)]

For the BOTTOM5 countries, everything is coherent. The **Pitcairn Islands**, or just Pitcairn, located in the southern Pacific Ocean, are the least populous national jurisdiction in the world. **Niue** and **Tokelau** are also very isolated islands in the southern Pacific Ocean, while **Cocos Islands** – in the Indian Ocean. Among the BOTTOM5 countries by population, not surprisingly, there is also the microstate **Vatican**.

In our database, there are some territories with null values of the population.

In [27]:
%%sql
SELECT name, population
  FROM facts
WHERE population IS NULL;

 * sqlite:///factbook.db
Done.

[('Ashmore and Cartier Islands', None),
 ('Coral Sea Islands', None),
 ('Heard Island and McDonald Islands', None),
 ('Clipperton Island', None),
 ('French Southern and Antarctic Lands', None),
 ('Bouvet Island', None),
 ('Jan Mayen', None),
 ('British Indian Ocean Territory', None),
 ('South Georgia and South Sandwich Islands', None),
 ('Navassa Island', None),
 ('Wake Island', None),
 ('United States Pacific Island Wildlife Refuges', None),
 ('Paracel Islands', None),
 ('Spratly Islands', None),
 ('Arctic Ocean', None),
 ('Atlantic Ocean', None),
 ('Indian Ocean', None),
 ('Pacific Ocean', None),
 ('Southern Ocean', None)]

All these territories represent either different uninhabited islands or the oceans.